hrshygoodness/Luminary-Micro-Library/boards/dk-lm3s9d96/drivers/usb_sound.c
    for(ulChannel = 0; ulChannel < 3; ulChannel++)
    {
        ulMax = USBHostAudioVolumeMaxGet(g_ulAudioInstance, 0, ulChannel);
        ulMin = USBHostAudioVolumeMinGet(g_ulAudioInstance, 0, ulChannel);
        ulRes = USBHostAudioVolumeResGet(g_ulAudioInstance, 0, ulChannel);

        g_sAudioState.pulSteps[ulChannel] = (ulMax - ulMin) / ulRes;
    }
}

//*****************************************************************************
//
// The main routine for handling USB audio, this should be called periodically
// by the main program and pass in the amount of time in milliseconds that has
// elapsed since the last call.
//
//*****************************************************************************
void
USBMain(unsigned long ulTicks)
{
    //
    // Tell the OTG library code how much time has passed in
    // milliseconds since the last call.
    //
    USBOTGMain(ulTicks);

    switch(g_sAudioState.eState)
    {
        //
        // This is the running state where buttons are checked and the
        // screen is updated.
        //
        case STATE_DEVICE_READY:
        {
            if(HWREGBITW(&g_sAudioState.ulEventFlags, EVENT_CLOSE))
            {
                HWREGBITW(&g_sAudioState.ulEventFlags, EVENT_CLOSE) = 0;
                g_sAudioState.eState = STATE_NO_DEVICE;

                //
                // Call the general event handler if present.
                //
                if(g_sAudioState.pfnCallbackEvent)
                {
                    g_sAudioState.pfnCallbackEvent(SOUND_EVENT_DISCONNECT, 0);
                }
            }
            break;
        }

        //
        // If there is no device then just wait for one.
        //
        case STATE_NO_DEVICE:
        {
            if(HWREGBITW(&g_sAudioState.ulEventFlags, EVENT_OPEN))
            {
                g_sAudioState.eState = STATE_DEVICE_READY;

                HWREGBITW(&g_sAudioState.ulEventFlags, EVENT_OPEN) = 0;

                GetVolumeParameters();

                //
                // Call the general event handler if present.
                //
                if(g_sAudioState.pfnCallbackEvent)
                {
                    g_sAudioState.pfnCallbackEvent(SOUND_EVENT_READY, 0);
                }
            }
            break;
        }

        //
        // An unknown device was connected.
        //
        case STATE_UNKNOWN_DEVICE:
        {
            break;
        }

        //
        // Something has caused a power fault.
        //
        case STATE_POWER_FAULT:
        {
            break;
        }

        default:
        {
            break;
        }
    }
}
